//
//  main.c
//  指针
//
//  Created by fudo on 16/4/13.
//  Copyright © 2016年 付栋. All rights reserved.
//

#include <stdio.h>

int main(int argc, const char * argv[]) {
    
    
    
    //************************基本使用********************//
    
    int m = 10;
    
    int* p = &m;// 定义的同时初始化
    
    *p;//拿到p所指向的变量,就是拿到m的值.(取值)
    
    *p = 100;//拿到p所指向的变量,在把它改成100.(赋值)
    
    
    
    //************************"*号"的2个作用********************//
    
    //1,在定义变量的时候,*是类型说明符,说明定义的这个变量是一个指针变量.
    
//        int a = 5;
//    
//        int *p = &a;//此处的*号就表示指针类型的变量
//    
//        int *p1 = p;
//    
    
    //2,在不定义变量的时候,*是一个操作符,操作指针指向的这个变量(赋值和取值)
    
        int a = 5;
        int* p = &a;
        
        printf( "*p = %d\n",*p); //取值
        
        *p = 100;  //赋值
        
        printf("a的值是%d\n",a);
    
    return 0;
}
